emacs/.spacemacs.d/docs/01_INSTALL.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge523051">1. Requirements Before You Begin</a>
<ul>
<li><a href="#orgf28e3ab">1.1. Source Code Pro Font</a></li>
<li><a href="#orgb7ff2bc">1.2. Homebrew</a></li>
<li><a href="#orgc22c55c">1.3. Node + NPM</a></li>
<li><a href="#org1ee48ff">1.4. Latest Git</a></li>
<li><a href="#org8917d72">1.5. External tools required by Spacemacs packages</a></li>
</ul>
</li>
<li><a href="#orgd335164">2. Spacemaxed</a>
<ul>
<li><a href="#org3572697">2.1. Delete or move any existing "~/.spacemacs" file or "~/.spacemacs.d" folder</a></li>
<li><a href="#org63f20b4">2.2. Place my "spacemaxed" dotfolder on the hard disk as "~/.spacemacs.d/"</a></li>
<li><a href="#org8f8cf99">2.3. Install YAMAMOTO Mitsuharu (railwaycat)'s Enhanced Emacs for macOS</a></li>
<li><a href="#org56ede8b">2.4. Install the development version of Spacemacs</a></li>
<li><a href="#org3f8a331">2.5. Install the Paintvars layer for Spacemacs</a></li>
<li><a href="#org538a4eb">2.6. Launch Emacs (the GUI version) and let it install all packages</a></li>
<li><a href="#org2ba5be3">2.7. Restart Emacs to finalize the package installation</a></li>
</ul>
</li>
<li><a href="#orgcaa3cc6">3. Updating Spacemacs in the future</a>
<ul>
<li><a href="#org7ee1784">3.1. First press "[Update Packages]" on the Spacemacs starting page</a></li>
<li><a href="#org348aebf">3.2. Then close Spacemacs and update the repository</a></li>
<li><a href="#org86030f5">3.3. Start Spacemacs again to complete the upgrade</a></li>
<li><a href="#orgab88ee4">3.4. Lastly, check for and merge any changes to the user-config template</a></li>
</ul>
</li>
<li><a href="#org6ef72ff">4. Uninstalling Spacemacs</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge523051" class="outline-2">
<h2 id="orge523051"><span class="section-number-2">1</span> Requirements Before You Begin</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgf28e3ab" class="outline-3">
<h3 id="orgf28e3ab"><span class="section-number-3">1.1</span> Source Code Pro Font</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Download the font release file and install all of the OTF (<i>not</i> TTF)
fonts from <a href="https://github.com/adobe-fonts/source-code-pro">https://github.com/adobe-fonts/source-code-pro</a>.
</p>
</div>
</div>

<div id="outline-container-orgb7ff2bc" class="outline-3">
<h3 id="orgb7ff2bc"><span class="section-number-3">1.2</span> Homebrew</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Install homebrew from <a href="http://brew.sh">http://brew.sh</a>.
</p>
</div>
</div>

<div id="outline-container-orgc22c55c" class="outline-3">
<h3 id="orgc22c55c"><span class="section-number-3">1.3</span> Node + NPM</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Use homebrew to install the latest Node and NPM (which is yet another package
manager). Lots of important utilities for programming are written in Node
and will be installed via NPM.
</p>

<p>
We must upgrade to the latest NPM after installation, since it gets updated
and fixed more frequently than the Node version it's bundled with.
</p>

<pre class="example">
brew install node
npm install npm@latest -g
</pre>

<p>
You should use <a href="https://www.npmjs.com">https://www.npmjs.com</a> if you ever want to search for packages,
because the command-line search is terribly slow in NPM.
</p>
</div>
</div>

<div id="outline-container-org1ee48ff" class="outline-3">
<h3 id="org1ee48ff"><span class="section-number-3">1.4</span> Latest Git</h3>
<div class="outline-text-3" id="text-1-4">
<pre class="example">
brew install git
</pre>
</div>
</div>

<div id="outline-container-org8917d72" class="outline-3">
<h3 id="org8917d72"><span class="section-number-3">1.5</span> External tools required by Spacemacs packages</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Run all of these commands unless you're <i>sure</i> what you're doing. All of
these are required for normal operation of multiple Spacemacs layers.
</p>

<pre class="example">
brew install multimarkdown # provides "markdown" binary
brew install shellcheck # needed for linting in "shell-scripts"
npm install -g tern # needed for javascript auto-completion
npm install -g js-beautify # needed for javascript auto-formatting
npm install -g jshint # needed for javascript error checking
brew install fzf # needed for fzf (fuzzy find)
brew install ag # needed for helm-ag (source greping)
brew install editorconfig # core library needed for support
</pre>
</div>
</div>
</div>


<div id="outline-container-orgd335164" class="outline-2">
<h2 id="orgd335164"><span class="section-number-2">2</span> Spacemaxed</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org3572697" class="outline-3">
<h3 id="org3572697"><span class="section-number-3">2.1</span> Delete or move any existing "~/.spacemacs" file or "~/.spacemacs.d" folder</h3>
</div>

<div id="outline-container-org63f20b4" class="outline-3">
<h3 id="org63f20b4"><span class="section-number-3">2.2</span> Place my "spacemaxed" dotfolder on the hard disk as "~/.spacemacs.d/"</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example">
git clone https://github.com/SteveJobzniak/spacemaxed.git ~/spacemaxed
mv ~/spacemaxed/spacemaxed ~/.spacemacs.d
rm -rf ~/spacemaxed # delete temporary folder
</pre>
</div>
</div>

<div id="outline-container-org8f8cf99" class="outline-3">
<h3 id="org8f8cf99"><span class="section-number-3">2.3</span> Install YAMAMOTO Mitsuharu (railwaycat)'s Enhanced Emacs for macOS</h3>
<div class="outline-text-3" id="text-2-3">
<p>
This will install the latest Emacs for macOS with all required addons, a nice
Spacemacs icon and a link in /Applications. This version is far better than
"vanilla" Emacs. It's built on the latest GNU Emacs sources, but adds tons of
Mac-specific enhancements, bugfixes, performance and stability improvements.
And it has built-in SVG support via WebKit.
</p>

<p>
The command below takes a very long time to install. Wait for it.
</p>

<pre class="example">
brew tap railwaycat/emacsmacport
brew install emacs-mac --with-gnutls --with-imagemagick --with-modules --with-texinfo --with-xml2 --with-spacemacs-icon
brew linkapps emacs-mac
</pre>
</div>
</div>

<div id="outline-container-org56ede8b" class="outline-3">
<h3 id="org56ede8b"><span class="section-number-3">2.4</span> Install the development version of Spacemacs</h3>
<div class="outline-text-3" id="text-2-4">
<p>
The development version is very stable, and is always way ahead of the master
branch in terms of bugfixes.
</p>

<pre class="example">
# Install Spacemacs
rm -rf ~/.emacs.d
git clone https://github.com/syl20bnr/spacemacs ~/.emacs.d

# Switch to development version
cd ~/.emacs.d &amp;&amp; git checkout develop
</pre>
</div>
</div>

<div id="outline-container-org3f8a331" class="outline-3">
<h3 id="org3f8a331"><span class="section-number-3">2.5</span> Install the Paintvars layer for Spacemacs</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Until my bugfixes have been merged into the official "colors" layer, just
install my alternative layer which contains the same code with a new name.
</p>

<pre class="example">
git clone https://github.com/SteveJobzniak/spacemacs-private-paintvars.git ~/.spacemacs.d/layers/paintvars
</pre>
</div>
</div>

<div id="outline-container-org538a4eb" class="outline-3">
<h3 id="org538a4eb"><span class="section-number-3">2.6</span> Launch Emacs (the GUI version) and let it install all packages</h3>
</div>

<div id="outline-container-org2ba5be3" class="outline-3">
<h3 id="org2ba5be3"><span class="section-number-3">2.7</span> Restart Emacs to finalize the package installation</h3>
</div>
</div>


<div id="outline-container-orgcaa3cc6" class="outline-2">
<h2 id="orgcaa3cc6"><span class="section-number-2">3</span> Updating Spacemacs in the future</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org7ee1784" class="outline-3">
<h3 id="org7ee1784"><span class="section-number-3">3.1</span> First press "[Update Packages]" on the Spacemacs starting page</h3>
</div>

<div id="outline-container-org348aebf" class="outline-3">
<h3 id="org348aebf"><span class="section-number-3">3.2</span> Then close Spacemacs and update the repository</h3>
<div class="outline-text-3" id="text-3-2">
<pre class="example">
cd ~/.emacs.d &amp;&amp; git pull --rebase
</pre>
</div>
</div>

<div id="outline-container-org86030f5" class="outline-3">
<h3 id="org86030f5"><span class="section-number-3">3.3</span> Start Spacemacs again to complete the upgrade</h3>
</div>

<div id="outline-container-orgab88ee4" class="outline-3">
<h3 id="orgab88ee4"><span class="section-number-3">3.4</span> Lastly, check for and merge any changes to the user-config template</h3>
<div class="outline-text-3" id="text-3-4">
<p>
First try pressing <code>SPC f e D</code> to diff your config against the built-in
template. If that fails, just use a manual diff and apply any important
changes:
</p>

<pre class="example">
diff -u ~/.emacs.d/core/templates/.spacemacs.template ~/.spacemacs.d/init.el
</pre>
</div>
</div>
</div>


<div id="outline-container-org6ef72ff" class="outline-2">
<h2 id="org6ef72ff"><span class="section-number-2">4</span> Uninstalling Spacemacs</h2>
<div class="outline-text-2" id="text-4">
<p>
Just do all of the steps in reverse. As follows.
</p>

<pre class="example">
brew unlinkapps emacs-mac
brew rm emacs-mac
brew untap railwaycat/emacsmacport
rm -rf ~/.emacs.d
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: SteveJobzniak</p>
</div>
</body>
</html>
